In [1]:
import pandas as pd

In [3]:
#Q1.

data = [4, 8, 15, 16, 23, 42]
example_series = pd.Series(data)
print(example_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
#Q2.

sample_list = [1,2,3,4.2,"True","Ziba",(7,8),6j,{"apple","banana","watermelon"},{"name":"perpendicular","age":32}]
sample_series = pd.Series(sample_list)
print(sample_series)

0                                       1
1                                       2
2                                       3
3                                     4.2
4                                    True
5                                    Ziba
6                                  (7, 8)
7                                      6j
8             {banana, watermelon, apple}
9    {'name': 'perpendicular', 'age': 32}
dtype: object

In [10]:
#Q3.

provided_data = {"Name" : ["Alice","Bob","Claire"] , "Age" : [25,30,27] , "Gender" : ["Female", "Male","Female"]}
df = pd.DataFrame(provided_data)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [11]:
#Q4.

# DataFrame is a two-dimensional labeled data structure with columns that can be of different data types (similar to Excel spreadsheet).

# A Panda Series, on the other hand, is a one-dimensional array that is capable of holding data of any type.

# To simplify, DataFrame is a collection of Series objects, where each Series represents a column of the Data Frame.

In [13]:
# Example

sample_dataset = {"City":['New York','Los Angeles','Chicago'],'Population':[8524698,3977686,2716000],"Area (sq. mi)" : [468.9, 503, 227.3]}

df = pd.DataFrame(sample_dataset)

population_series = df['Population']

print("DataFrame:")
print(df)
print("\nSeries:")
print(population_series)

DataFrame:
          City  Population  Area (sq. mi)
0     New York     8524698          468.9
1  Los Angeles     3977686          503.0
2      Chicago     2716000          227.3

Series:
0    8524698
1    3977686
2    2716000
Name: Population, dtype: int64

In [16]:
#Q5.

# Common functions that are used to manipulate data in a Pandas DataFrame are explained using an example.

data = {
    
    'Name' : ['Alice','Bob','Claire','David','Emma'],
    'Age'  : [25,30,27,22,28],
    'Gender' : ['Female','Male','Female','Male','Female'],
    'Score' : [85,92,78,88,75]
}

In [17]:
df1 = pd.DataFrame(data)

In [21]:
#Display the first three rows of the DataFrame
df1.head(3)

     Name  Age  Gender  Score
0   Alice   25  Female     85
1     Bob   30    Male     92
2  Claire   27  Female     78

In [22]:
#Display the last two rows of the DataFrame
df1.tail(2)

    Name  Age  Gender  Score
3  David   22    Male     88
4   Emma   28  Female     75

In [23]:
#Extract the specific column from the DataFrame
ages = df1['Age']

In [25]:
ages

0    25
1    30
2    27
3    22
4    28
Name: Age, dtype: int64

In [27]:
#Extract the list of columns that are present in the DataFrame
df1.columns

Index(['Name', 'Age', 'Gender', 'Score'], dtype='object')

In [28]:
#Display the data types of each column
df1.dtypes

Name      object
Age        int64
Gender    object
Score      int64
dtype: object

In [30]:
#Extract data assocaited with multiple columns
name_scores = df1[['Age','Score']]

In [31]:
name_scores

   Age  Score
0   25     85
1   30     92
2   27     78
3   22     88
4   28     75

In [32]:
#Q6.

# All Pandas data structures are value mutable (i.e. their values can be modified after creation) and except Series all are size mutable as well. Series is size immutable.

In [34]:
#Q7.

names = pd.Series(['Alice','Bob','Claire'])
ages = pd.Series([25, 30, 27])
scores = pd.Series([85, 92, 78])

data = {'Name':names , 'Age':ages, 'Score':scores}
df2 = pd.DataFrame(data)

print(df2)

     Name  Age  Score
0   Alice   25     85
1     Bob   30     92
2  Claire   27     78